-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Янв 18 2021 г., 20:21
-- Версия сервера: 10.4.14-MariaDB
-- Версия PHP: 7.4.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `teamwork_bookshelf`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `cat_title` varchar(255) NOT NULL,
  `supercat_id` int(11) NOT NULL,
  `supercategory` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `cat_title`, `supercat_id`, `supercategory`) VALUES
(27, 'Современные авторы', 1, 'Художественная литература'),
(28, 'Романы про любовь', 1, 'Художественная литература'),
(29, 'Приключенческо-исторические романы', 1, 'Художественная литература'),
(30, 'Детективы', 1, 'Художественная литература'),
(31, 'фантастика', 1, 'Художественная литература'),
(32, 'Фэнтези', 1, 'Художественная литература'),
(33, 'Триллеры', 1, 'Художественная литература'),
(34, 'Классика', 1, 'Художественная литература'),
(35, 'Кулинария', 2, 'Прикладная литература'),
(36, 'Справочники', 2, 'Прикладная литература'),
(37, 'Красота и здоровье', 2, 'Прикладная литература'),
(38, 'Рукоделие', 2, 'Прикладная литература'),
(39, 'Психология', 2, 'Прикладная литература'),
(40, 'Саморазвитие и мотивация', 2, 'Прикладная литература'),
(41, 'Бизнес-литература', 2, 'Прикладная литература'),
(42, 'Детям до 4-х лет', 3, 'Детская литература'),
(43, 'Детям 4-6 лет', 3, 'Детская литература'),
(44, 'Детям 7-12 лет', 3, 'Детская литература'),
(45, 'Детям от 12 лет', 3, 'Детская литература'),
(46, 'Подготовка к школе', 3, 'Детская литература'),
(47, 'Детские энциклопедии', 3, 'Детская литература');

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `answer_for` int(11) NOT NULL DEFAULT 0,
  `user_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `time` datetime NOT NULL DEFAULT current_timestamp(),
  `num_likes` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `products` text NOT NULL,
  `sum_total` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `surname` varchar(255) NOT NULL,
  `patronymic` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `city` varchar(255) NOT NULL,
  `novaposhta` int(11) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `status` int(11) NOT NULL DEFAULT 0,
  `order_list` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `products`, `sum_total`, `name`, `surname`, `patronymic`, `phone`, `city`, `novaposhta`, `created_at`, `status`, `order_list`) VALUES
(19, '', 1550, 'm', '123', '', '123123', '123123', 123123123, '2021-01-18 14:11:07', 0, '{\"orders\":[{\"product_id\":\"50\",\"coast\":\"150\",\"count\":\"9\"},{\"product_id\":\"51\",\"coast\":\"50\",\"count\":4}]}'),
(20, '', 1875, 'asd', 'ads', '', '123', '3434', 55555, '2021-01-18 14:12:26', 0, '{\"orders\":[{\"product_id\":\"50\",\"coast\":\"150\",\"count\":7},{\"product_id\":\"51\",\"coast\":\"50\",\"count\":3},{\"product_id\":\"49\",\"coast\":\"225\",\"count\":3}]}'),
(21, '', 1550, 'm', '123', '', '123123', '123123', 123123123, '2021-01-18 14:11:07', 0, '{\"orders\":[{\"product_id\":\"50\",\"coast\":\"150\",\"count\":\"9\"},{\"product_id\":\"51\",\"coast\":\"50\",\"count\":4}]}'),
(22, '', 1875, 'asd', 'ads', '', '123', '3434', 55555, '2021-01-18 14:12:26', 0, '{\"orders\":[{\"product_id\":\"50\",\"coast\":\"150\",\"count\":7},{\"product_id\":\"51\",\"coast\":\"50\",\"count\":3},{\"product_id\":\"49\",\"coast\":\"225\",\"count\":3}]}'),
(23, '', 2250, '222', 'петренко', 'Петрович', '123123', '123', 240000, '2021-01-18 20:29:31', 0, '{\"orders\":[{\"product_id\":\"49\",\"coast\":\"225\",\"count\":\"6\"}]}');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `author` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `size` int(11) NOT NULL,
  `release_year` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `discounted_price` int(11) NOT NULL,
  `image` varchar(255) NOT NULL DEFAULT '/images/product/',
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `category_id` int(11) NOT NULL,
  `subcategory_id` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `description` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `author`, `title`, `size`, `release_year`, `price`, `discounted_price`, `image`, `date`, `category_id`, `subcategory_id`, `quantity`, `description`) VALUES
(50, 'Елена Ферранте', 'Історія втечі та повернення', 448, 2020, 180, 150, '../../../images/product/55395_105127_k.jpg', '2021-01-15 13:20:06', 28, 27, 48, 'Світ змінюється — той, що довкола, і твій власний. Колись Ліла на заздрість усім зіграла пишне весілля й оселилася в розкішній квартирі. Тепер вона з сином мешкає в злиденній новобудові і працює на ковбасній фабриці. Колись Елена кинула виклик суспільству й поїхала геть з Неаполя. Тепер вона — успішна письменниця, готується вийти заміж за професора з поважної родини. Дві молоді жінки, подруги дитинства, урешті опинилися у різних світах. Вони не бачитимуться роками, живучи тільки спогадами та короткими телефонними розмовами. Але відстань і час не здатні зруйнувати їхню близькість.  Неперевершена історія, справжній портрет жіночої дружби. Найліпший за всі!'),
(51, 'О. Головина', 'Мой милый байкер', 288, 2020, 85, 50, '/images/product/54379_101400_k.jpg', '2021-01-15 13:28:18', 29, 28, 17, 'Вера думала, что брак по расчету решит ее проблемы. Но в последний момент она сбежала с собственной свадьбы! Босоногая и растрепанная, в подвенечном платье, Вера выскочила на трассу. К счастью, вовремя появился спаситель на мотоцикле. И им оказался тот, у кого были все причины ненавидеть ее…'),
(52, 'Джоанна Ліндсей', 'Позволь любви найти тебя', 384, 2019, 155, 130, '/images/product/52815_95998_k.jpg', '2021-01-15 13:28:18', 30, 28, 10, 'Красавец Девин Болдвин, известный сват лондонского бомонда, соединил не одну пару любящих сердец. Но сам долгое время был одинок. Однажды юная аристократка Аманда Локк решает обратиться к Девину за помощью в поиске жениха. Она прелестна, словно лесная нимфа. И один ее взгляд стрелой пронзил сердце Девина. Пути назад нет, любовь уже вспыхнула в нем с неимоверной силой. Но будет ли она взаимной?..'),
(53, 'Джеймс Роллінс', 'Последняя одиссея', 448, 2020, 320, 320, '/images/product/55496_105769_k.jpg', '2021-01-15 13:37:31', 27, 29, 18, 'Исследователи ледников Гренландии наткнулись на шокирующую находку: арабское судно оказалось здесь на сто лет раньше викингов. На борту смертоносный груз — древние бронзовые механизмы—убийцы. А рядом с мумией капитана — механическая карта из золота и драгоценных камней. Ее основное назначение — указать координаты реального древнегреческого ада. За артефактом охотятся фанатики, желающие освободить из—под земли легендарных чудовищ и устроить Апокалипсис...'),
(54, 'К. Уэбб', 'Наследие', 480, 220, 69, 69, '/images/product/55498_105771_k.jpg', '2021-01-15 13:37:31', 28, 29, 5, 'Эрика и Бэт приезжают в поместье, которое досталось им от бабушки. Они проводили тут каждое лето, пока не исчез их брат Генри. Особняк — надежный хранитель тайн — погружает сестер в воспоминания. Сквозь провалы времени начинают проступать события минувших дней...'),
(55, 'Жорж Сіменон', 'Трубка Мегрэ. Самые знаменитые расследования комиссара Мегрэ', 1120, 2020, 330, 330, '/images/product/55504_105776_k.jpg', '2021-01-15 13:39:26', 29, 30, 20, 'Книги Жоржа Сименона известны всему миру. Мастер детективного жанра опубликовал более 400 произведений и создал одного из самых обаятельных сыщиков ХХ века — комиссара Мегрэ. Данная серия — настоящий подарок всем ценителям увлекательной литературы! Комиссар Мегрэ носит давно вышедшие из моды котелок и пальто, не расстается с трубкой, предпочитает дождливую погоду, обожает греться у огня и ходить, заложив руки за спину. Мрачный и немногословный, он обладает редким даром внушать доверие, ему известны тайные пружины человеческой драмы.'),
(56, 'Д. Карризи', 'Подсказчик', 480, 2020, 199, 199, '/images/product/55502_105774_k.jpg', '2021-01-15 13:42:47', 30, 30, 17, 'Пять девочек исчезают. Пять крошечных захоронений найдены на лесной опушке. В каждом — рука. У полицейских возникает ощущение, что ими манипулируют. К делу привлекают Милу Васкес. Возникает теория, в которую никто не хочет верить...'),
(57, 'Дж. Оруэлл', '1984. Скотный двор', 416, 2020, 160, 135, '/images/product/54179_100980_k.jpg', '2021-01-15 13:47:48', 31, 31, 0, 'Культовые антиутопии ХХ века  Два легендарных произведения британского писателя Джорджа Оруэлла потрясли мир, став предостережением и одновременно пророчеством…  2 + 2 = 5 Уинстон Смит — рядовой работник министерства правды, занимающегося постоянным обновлением и переписыванием истории. Он живет в мире двойных стандартов, где все контролирует полиция мыслей, запрещающая мыслить и министерство любви, причиняющее боль. Абсурдная реальность, жизнь по шаблону, чеканя шаг в колоннах одинаковых серых личностей. И у тебя нет шанса сделать шаг в сторону. Ты под надзором. Всегда и везде. Старший брат следит за тобой («1984»)  Все животные равны, но некоторые животные равнее. Однажды утром фермер Джонс забывает накормить скот. И тогда животные решают, что пришло время поднять восстание. Во главе со свиньями Наполеоном и Цицероном они изгоняют Джонса с фермы. Свиньи устанавливают свою власть и провозглашают семь заповедей. Но день за днем в сердцах других животных зреет сомнение: а так ли все они равны? Или среди них есть те, что считают себя равнее других?.. («Скотный двор»)'),
(58, 'Айзек Азімов', 'Фундація. Книга 1', 224, 2017, 167, 139, '/images/product/45651_70758_k.jpg', '2021-01-15 13:47:48', 32, 31, 0, 'Серія романів Айзека Азімова «Фундація», один із шедеврів наукової фантастики, є неперевершеною завдяки своєму унікальному поєднанню невпинної дії, сміливих ідей і широкомасштабної картини світу. Історія нашого майбутнього починається з історії Фундації та її найвидатнішого психоісторика — Гарі Селдона.  Галактична Імперія на шляху до занепаду. Попереду тисячоліття варварства і війн. Уникнути цього страхіття неможливо, але є шанс скоротити період руїни. Психоісторик Гарі Селдон знає, як це зробити. Саме він переконує імператора створити Фундацію — скарбницю надбань людства, з якої розпочнеться народження нової величної імперії. «План Селдона» спрацьовує, але жага влади і грошей стає перепоною у розвитку суспільства. Чи вдасться наступникам вченого скерувати рух історії у потрібному напрямку?'),
(59, 'Р. Гобб', 'Королівський убивця. Assassin 2', 688, 2019, 270, 230, '/images/product/52456_93969_k.jpg', '2021-01-15 13:53:41', 28, 32, 0, 'Від культового автора епічного фентезі!  Позашлюбний син принца-наступника. Той, кого переслідувала смерть. Той, хто сам став смертю. Маленький хлопчик, що виріс у холоднокровного найманого вбивцю. На нього чекав шлях мовчазного найманця, покірного служки свого короля. Але тепер Фітц — мисливець на «перекованих», людей, у яких було знищено все людське. Його місія небезпечна. Одна похибка може вартувати життя. Та Фітц не сам. Слід у слід за ним ступає приручений та вихований ним вовк Нічноокий. Наближається час перевороту. Час, коли Фітц має виконати своє призначення. Його переслідуватимуть, на нього полюватимуть. І якщо він хоче врятуватися — він має забути про людську подобу. І стати вовком…'),
(60, 'К.Б. Мищук', 'Я, дьяволица', 448, 2020, 205, 205, '/images/product/55351_104808_k.jpg', '2021-01-15 13:53:41', 28, 32, 0, 'В свои двадцать Виктория умирает при загадочных обстоятельствах. И попадает из Варшавы в настоящий ад, где ее вербуют в дьяволицы. Должность особая — теперь девушка торгуется с ангелами за души умерших. И работает рука об руку с дьяволами Азазелем и Белетом. Нижняя Аркадия полна контрастов и на удивление напоминает земной бюрократический ад. Здесь можно притвориться живой, сотворить шикарное платье для свидания, повстречать саму Клеопатру с Цезарем или расследовать обстоятельства своей гибели. А потом очутиться на балу Сатаны, устроить революцию и Третью мировую... Но можно ли найти любовь в Лос—Дьяблосе? Или для этого придется вернуться на Землю?'),
(61, 'Тесс Ґеррітсен', 'Хірург', 352, 2016, 155, 130, '/images/product/39204_59413_k.jpg', '2021-01-15 14:00:04', 29, 33, 0, 'Він приходить лише у ночі. Безшумно проникає у дім. Крадеться до спальні, де тільки но прокинувшись від сну, самотні жінки потрапляють до приголомшливого кошмару. Зважаючи на те, що він робить зі своїми жертвами, можна припустити, що злодій знається на медицині. Саме через це його називають Хірург.  Томас Мур та Джейн Ріццолі розслідують серію страшенних вбивств. Злочинець наслідує почерк серійного маніяка, якого було вбито два роки тому. Він копією навіть такі дрібні деталі, про які мало кому відомо. Остання з жертв загиблого маніяка Кетрін Корделл, вбила його, та саме через це стає метою нового вбивці. Із кожною наступною жертвою невідомий наближається до Кетрін. Саме Томасу та Джейн доведеться зупинити геніального вбивцю, чого б це не коштувало.'),
(62, 'Меделін Ру', 'Приют. Книга 1', 320, 2019, 169, 140, '/images/product/27275_40420_k.jpg', '2021-01-15 14:00:04', 32, 33, 0, 'Старое здание... Потрескавшиеся стены... Загадочные фотографии... Ночные кошмары... Тот, кто попадал в этот дом, оставался в нем навсегда. Но Дэниэл этого не знал. Он приехал сюда на летние курсы для одаренных подростков и гораздо позже узнал, что когда-то это здание было лечебницей для странных людей. Что происходило здесь? Почему некоторые коридоры и подвал замурованы? Кто-то тайком следит за ним. В библиотеке колледжа Дэниэл с друзьями находит загадочные фотографии. А вскоре случается то, что повергает в шок и учеников, и педагогов. Дэн должен разгадать тайну приюта, иначе он сам окажется в опасности... Книга иллюстрирована уникальными рисунками и фото.'),
(63, 'Луїза Олкотт', 'Маленькие мужчины', 320, 2020, 145, 119, '/images/product/54601_101724_k.jpg', '2021-01-15 14:05:25', 34, 34, 0, 'Джо и Фриц Бэры открыли частную школу для мальчиков. Но эта школа отличается от обычных учебных заведений: ее ученики не знают, что такое зубрежка и суровая дисциплина. Мудрая Джо дарит детям любовь, заботу, внимание и старается сделать из шаловливых и непослушных ребят настоящих маленьких мужчин. А ее муж помогает найти мальчикам их призвание. Воспитанники школы, разные по характеру и мировоззрению, вместе учатся преодолевать трудности и отвечать за свои поступки. Супруги Бэры заменяют им родителей, окружая каждого ученика теплом и заботой. Здесь они учатся смелости и честности, дружбе и, главное, доброте. Ведь впереди их ждет взрослая жизнь, полная не только захватывающих открытий, но и первых юношеских ошибок...'),
(64, 'Энн Бронте', 'Агнес Грей', 288, 2020, 155, 130, '/images/product/53256_97506_k.jpg', '2021-01-15 14:05:25', 33, 34, 0, ''),
(65, 'Емі Канеко', 'Готуємо по-японськи. Щоденні рецепти автентичних страв', 168, 2019, 250, 250, '/images/product/54009_100642_k.jpg', '2021-01-15 14:11:03', 35, 35, 0, ''),
(66, 'Є. Клопотенко', 'Зваблення їжею з українським смаком', 176, 2020, 300, 300, '/images/product/55311_104589_k.jpg', '2021-01-15 14:11:03', 37, 35, 0, ''),
(67, '', 'Правила дорожнього руху України з ілюстраціями основних положень 2021', 72, 2020, 35, 35, '/images/product/55523_105802_k.jpg', '2021-01-15 14:18:17', 34, 36, 0, ''),
(68, 'Ю. Подольский', 'Практика сварочных работ в домашних условиях', 320, 2019, 90, 75, '/images/product/49543_83618_k.jpg', '2021-01-15 14:18:17', 36, 36, 0, ''),
(69, 'Кай-Міхаель Бе', 'Внутрішня історія. Легені. Дивовижний світ нашого дихання', 304, 2020, 179, 149, '/images/product/53522_105615_k.jpg', '2021-01-15 14:23:10', 33, 37, 0, ''),
(70, 'Валикри', 'Йога. Шесть жемчужин', 288, 2020, 179, 179, '/images/product/53760_98955_k.jpg', '2021-01-15 14:23:10', 27, 37, 0, ''),
(71, 'Л. Бебешко', 'Українські вишиванки: орнаменти, композиції', 128, 2019, 130, 110, '/images/product/51877_91496_k.jpg', '2021-01-15 14:28:23', 29, 38, 0, ''),
(72, 'Ю. Корф', 'Трикотажные платья, юбки, блузы, брюки. Шьем сами. Женская одежда от 42 до 52 размера', 96, 2018, 120, 100, '/images/product/48037_77576_k.jpg', '2021-01-15 14:28:23', 28, 38, 0, ''),
(73, 'К. Прайор', 'Мистецтво виховання та дресирування. Не поспішайте стріляти в собаку!', 320, 2020, 180, 155, '/images/product/55471_105631_k.jpg', '2021-01-15 18:43:50', 28, 39, 0, ''),
(74, 'Брене Браун', 'Стань сильнішим', 288, 2016, 140, 120, '../../../images/product/53256_97506_k.jpg', '2021-01-15 18:43:50', 27, 39, 0, ''),
(75, 'Т. Сворт', 'Джерело: відкрий свій розум та зміни життя', 288, 2020, 169, 140, '../../../images/product/52815_95998_k.jpg', '2021-01-15 18:48:53', 2, 40, 0, ''),
(76, 'В. Вуд', 'Хороші звички, погані звички. Наука позитивних змін', 384, 2020, 225, 225, '../../../images/product/54009_100642_k.jpg', '2021-01-15 18:48:53', 27, 40, 0, ''),
(77, 'Т. Водотика', 'Iсторiї успiху: видатні українські бізнесмени ХІХ ст.', 240, 2020, 260, 260, '../../../images/product/52815_95998_k.jpg', '2021-01-15 18:53:15', 2, 41, 0, ''),
(78, 'Джейсон Фрайд, Девід Хайнемайєр Хенссон', 'Rework. Ця книжка змінить ваш погляд на бізнес', 176, 2016, 140, 120, '../../../images/product/52815_95998_k.jpg', '2021-01-15 18:53:15', 2, 41, 0, ''),
(79, '', 'Зайчикова хатка. Панорамка з рухомими елементами', 8, 2020, 108, 108, '../../../images/product/52815_95998_k.jpg', '2021-01-15 18:57:57', 3, 42, 0, ''),
(80, '', 'Потішки та вірші малюкам', 128, 2019, 140, 140, '../../../images/product/52815_95998_k.jpg', '2021-01-15 18:57:57', 3, 42, 0, ''),
(81, 'Шарль Перро', 'Чарівний світ казок', 80, 2019, 180, 150, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:02:27', 3, 43, 0, ''),
(82, 'Ф. Зальтен', 'Бемби', 128, 2018, 135, 135, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:02:27', 3, 43, 0, ''),
(83, '', 'Найкращі історії для хлопчиків', 384, 2020, 200, 0, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:06:20', 3, 44, 0, ''),
(84, 'Б. Фішу, М. Бейні', 'Ненудна наука', 88, 2020, 200, 0, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:06:20', 3, 44, 0, ''),
(85, 'Х. К. Алонсо, Ґ. С. Пол', 'Юрський період: Динозаври та інші давні тварини', 112, 2020, 179, 149, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:11:28', 3, 45, 0, ''),
(86, 'А. Троян–Яскот', 'Як стати кимось. Порадник підлітка', 160, 2020, 125, 125, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:11:28', 3, 45, 0, ''),
(87, '', 'Математика до школи. Збірка завдань', 80, 2017, 90, 90, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:15:51', 3, 46, 0, ''),
(88, 'А. Журавльова, В. Федієнко', 'Книга для читання та розвитку зв’язного мовлення', 80, 2018, 140, 140, '../../../images/product/52815_95998_k.jpg', '2021-01-15 19:15:51', 3, 46, 0, ''),
(89, 'П. Ганачкова, Т. Маковська', '80 хитромудрих запитань', 17, 2019, 300, 300, '../../../images/product/39204_59413_k.jpg', '2021-01-15 19:20:23', 27, 47, 0, ''),
(90, 'Р. Мартін', 'Маленькі дослідники: Динозаври', 18, 2018, 290, 290, '../../../images/product/52456_93969_k.jpg', '2021-01-15 19:20:23', 27, 47, 0, ''),
(100, 'В.В.Васильев', 'Back-end developer', 875, 2023, 0, 667, '../../../images/product/39204_59413_k.jpg', '2021-01-17 18:24:33', 12, 0, 0, 'фывфывфывфвывфввфы'),
(101, 'Д.Д.Дмитриев', 'Front-end developer', 15, 1920, 9022, 667, '../../../images/product/52815_95998_k.jpg', '2021-01-17 18:30:56', 3, 0, 5, 'Боль.'),
(102, 'В.В.Васильев', 'Фисташки', 875, 2023, 555, 0, '../../../images/product/55502_105774_k.jpg', '2021-01-18 20:41:45', 44, 0, 5, 'фывфыв');

-- --------------------------------------------------------

--
-- Структура таблицы `tag`
--

CREATE TABLE `tag` (
  `id` int(11) NOT NULL,
  `tag` varchar(255) NOT NULL,
  `tag_data` datetime NOT NULL DEFAULT current_timestamp(),
  `tag_category_id` int(11) NOT NULL DEFAULT 18
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `tag`
--

INSERT INTO `tag` (`id`, `tag`, `tag_data`, `tag_category_id`) VALUES
(1, 'Фентези', '2021-01-16 12:38:15', 15),
(2, 'Sci-fi', '2021-01-16 12:38:36', 15),
(3, 'Драма', '2021-01-16 12:38:52', 0),
(4, 'Романтика', '2021-01-16 12:39:05', 0),
(5, 'Биографические', '2021-01-16 12:39:15', 0),
(6, 'Боевики', '2021-01-16 12:39:25', 0),
(7, 'Классические детективы', '2021-01-16 12:41:38', 0),
(8, 'Полицейские детективы', '2021-01-16 12:41:57', 0),
(9, 'Иронические детективы', '2021-01-16 12:41:59', 0),
(10, 'роварвал', '2021-01-16 20:00:10', 18);

-- --------------------------------------------------------

--
-- Структура таблицы `users_admins`
--

CREATE TABLE `users_admins` (
  `id` int(11) NOT NULL,
  `login` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `user_personal_id` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `tag`
--
ALTER TABLE `tag`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users_admins`
--
ALTER TABLE `users_admins`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT для таблицы `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=103;

--
-- AUTO_INCREMENT для таблицы `tag`
--
ALTER TABLE `tag`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `users_admins`
--
ALTER TABLE `users_admins`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
